# Задача 30:  Заполните массив элементами арифметической прогрессии.
# Её первый элемент, разность и количество элементов нужно ввести с клавиатуры.
# Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d.
# Каждое число вводится с новой строки.


# num1 = int(input("Num1: "))
# num2 = int(input("Num2: "))
# num3 = int(input("Num3: "))

# def upch(a, b, c):
#     for i in range(c):
#         print(a1 + i * d)
# upch(num1,num2,num3)

# Задача 32: Определить индексы элементов массива (списка), 
# значения которых принадлежат заданному диапазону (т.е. не меньше заданного минимума 
#                                                   и не больше заданного максимума)

# arr =  [-5, 9, 0, 3, -1, -2, 1, 4, -2, 10, 2, 0, -9, 8, 10, -9, 0, -5, -5, 7]

# num1 = int(input("Num1: "))
# num2 = int(input("Num2: "))
# arr2 = []
# for inx, i in enumerate(arr):
#     if i>num1 and i<num2:
#         arr2.append(inx)

# print(arr2)